- Merge
- groupby()
- Crosstab
- pivot
- pivot_table
- datetime module
- Aggregate Function

In [9]:
import pandas as pd

## Merge

The merge() function in Pandas combines two or more DataFrames by matching rows based on specified columns, allowing you to create a single unified dataset.

- inner
- left
- right
- outer

### syntax

pd.merge(dataframe1,dataframe2,on='column_name',how='merging_method')

### example

In [2]:
a1=pd.DataFrame({'Name':['komal','kartik','priya'],'ID':[101,102,103],'Cities':['Bhandara','nagpur','pune']})

a1

     Name   ID    Cities
0   komal  101  Bhandara
1  kartik  102    nagpur
2   priya  103      pune

In [3]:

a2=pd.DataFrame({'Name':['nidhi','poonam','nikita'],'ID':[101,105,103],'Cities':['pune','hyd','mumbai']})

a2

     Name   ID  Cities
0   nidhi  101    pune
1  poonam  105     hyd
2  nikita  103  mumbai

## inner

#### inner merge only show matching records from both the dataframe.

In [4]:
d3=pd.merge(a1,a2,on='ID',how='inner')## Merging two DataFrames 'a1' and 'a2' based on the 'ID' column using an inner join.

d3                                  # return matching records from both the datasets

  Name_x   ID  Cities_x  Name_y Cities_y
0  komal  101  Bhandara   nidhi     pune
1  priya  103      pune  nikita   mumbai

### left

display full records from left dataframe and only matching records from right dataframe

#### example

In [5]:
d4=pd.merge(a1,a2,on='ID',how='left')

d4

   Name_x   ID  Cities_x  Name_y Cities_y
0   komal  101  Bhandara   nidhi     pune
1  kartik  102    nagpur     NaN      NaN
2   priya  103      pune  nikita   mumbai

### right

In [6]:
display full records from right dataframe and only matching records from left dataframe

SyntaxError: invalid syntax (704853844.py, line 1)

In [ ]:
d5=pd.merge(a1,a2,on='ID',how='right')

d5

### outer

#### display full record from both the dataframes

In [ ]:
d4=pd.merge(a1,a2,on='ID',how='outer')

d4

In [ ]:
#####################################################################################################################
#####################################################################################################################

## groupby()

The groupby is one of the most frequently used Pandas functions in data analysis. It is used for grouping the data points (i.e. rows) based on the distinct values in the given column or columns. We can then calculate aggregated values for the generated groups.

In [ ]:
import pandas as pd

In [ ]:
df1 =pd.read_csv(r"Employee.csv")

df1

In [ ]:
df1.loc[0,["gender","city"]]

#### example

In [ ]:
g=df1.groupby('gender')         # Grouping the DataFrame 'df1' by the 'gender' column.

g

In [ ]:
g.groups      # Accessing the groups created by the 'groupby' operation and displaying them.

In [ ]:
g.get_group('F')

In [ ]:
g.get_group('M')

In [ ]:
g.get_group('M')['salary']

In [ ]:
g.get_group('M')['salary'].mean()

In [ ]:
g.get_group('M')['salary'].min()

In [ ]:
Aggregate functions


- mean(avg)
- min
- max
- count
- sum

In [ ]:
# example3

g.get_group('F')['salary']

In [ ]:
# example4

#mean--->avg

g.get_group('F')['salary'].mean()

In [ ]:
g.get_group('F')['salary'].count()

In [ ]:
g.get_group('F')['salary'].min()

In [ ]:
df1

- min
- max
- sum
- mean

In [ ]:
g2 = df1.groupby(['gender','city'])

g2

In [ ]:
g2.groups

In [ ]:
df1

In [ ]:
g2.get_group(('M','pune'))

In [ ]:
g2.get_group(('M','pune'))['experience']

In [ ]:
g2.get_group(('M','pune'))['experience'].max()

In [ ]:
g2.get_group(('M','pune'))['experience'].count()

In [ ]:
df1

In [ ]:
#############################################################################################################
##################################################################################################################

In [ ]:
pip install xlrd

## Crosstab

#### cross tabulation

The Crosstab function in Pandas is a method for restructuring and summarizing data, particularly useful for analyzing relationships between categorical variables.

In [11]:
import pandas as pd

df2 = pd.read_excel(r'C:\Users\Fireblaze2023\Downloads\survey.xls')

df2   #encoding='latin'

      Name Nationality  Gender  Age Handedness
0    Kathy         USA  Female   23      Right
1    Linda         USA  Female   18      Right
2    Peter         USA    Male   19      Right
3     John         USA    Male   22       Left
4   Fatima   Bangadesh  Female   31       Left
5    Kadir   Bangadesh    Male   25       Left
6   Dhaval       India    Male   35       Left
7   Sudhir       India    Male   31       Left
8   Parvir       India  Female   37      Right
9      Yan       China  Female   52      Right
10    Juan       China  Female   58       Left
11   Liang       China    Male   43       Left

#### syntax

pd.crosstab(index,column)

#### example1

In [12]:
pd.crosstab(df2.Nationality,df2.Handedness)

Handedness   Left  Right
Nationality
Bangadesh       2      0
China           2      1
India           2      1
USA             1      3

In [13]:
pd.crosstab([df2.Nationality,df2.Age],df2.Handedness)

Handedness       Left  Right
Nationality Age
Bangadesh   25      1      0
            31      1      0
China       43      1      0
            52      0      1
            58      1      0
India       31      1      0
            35      1      0
            37      0      1
USA         18      0      1
            19      0      1
            22      1      0
            23      0      1

In [14]:
pd.crosstab([df2.Nationality,df2.Age],[df2.Handedness],margins=True)

Handedness       Left  Right  All
Nationality Age
Bangadesh   25      1      0    1
            31      1      0    1
China       43      1      0    1
            52      0      1    1
            58      1      0    1
India       31      1      0    1
            35      1      0    1
            37      0      1    1
USA         18      0      1    1
            19      0      1    1
            22      1      0    1
            23      0      1    1
All                 7      5   12

In [16]:
pd.crosstab([df2.Nationality,df2.Age],[df2.Handedness],margins=True,margins_name="total")

Handedness       Left  Right  total
Nationality Age
Bangadesh   25      1      0      1
            31      1      0      1
China       43      1      0      1
            52      0      1      1
            58      1      0      1
India       31      1      0      1
            35      1      0      1
            37      0      1      1
USA         18      0      1      1
            19      0      1      1
            22      1      0      1
            23      0      1      1
total               7      5     12

#### example2

In [ ]:
# pd.crosstab(df2.Gender,df2.Handedness)

#### example3

In [ ]:
pd.crosstab([df2.Nationality,df2.Gender],[df2.Handedness])

### margins

In [ ]:
# example


pd.crosstab([df2.Nationality,df2.Gender],[df2.Handedness],margins=True,margins_name='Total')

In [ ]:
pd.crosstab(df2.Gender,df2.Handedness,margins=True,margins_name='Sum')

### multi index,columns

In [ ]:
# pd.crosstab([df2.Nationality,df2.Gender],[df2.Handedness],margins=True,margins_name='Sum')

In [ ]:
##########################################################################

# pivot

- Reshape data
- To summarized the data
- duplication not allowed

In [17]:
import pandas as pd

df3 =pd.read_csv(r"Employee.csv")

df3

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

#### syntax

dataframe_name.pivot(index='column_name',columns='columns_name',values="column_name")

In [19]:
df3

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

#### example

In [18]:
df3.pivot(index='Id',columns='city',values='salary')

city     beed  bhandara   gondia   mumbai   nagpur     pune
Id
1001      NaN       NaN      NaN      NaN      NaN  10000.0
1002      NaN       NaN      NaN  50000.0      NaN      NaN
1003      NaN       NaN      NaN      NaN      NaN      NaN
1004  60000.0       NaN      NaN      NaN      NaN      NaN
1005  70000.0       NaN      NaN      NaN      NaN      NaN
1006      NaN   50000.0      NaN      NaN      NaN      NaN
1007  20000.0       NaN      NaN      NaN      NaN      NaN
1008      NaN       NaN      NaN      NaN      NaN  80000.0
1009      NaN       NaN      NaN      NaN  60000.0      NaN
1010      NaN       NaN      NaN      NaN      NaN  30000.0
1011      NaN       NaN      NaN      NaN  90000.0      NaN
1012      NaN       NaN  40000.0      NaN      NaN      NaN
1013      NaN   10000.0      NaN      NaN      NaN      NaN
1014      NaN       NaN  80000.0      NaN      NaN      NaN
1015      NaN       NaN      NaN      NaN  50000.0      NaN

In [ ]:
# example2

# df3.pivot(index='Id',columns='city',values='salary')

In [21]:
df3

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [20]:
# # example3


df3.pivot(index='gender',columns='Id',values='salary')

Id,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012,1013,1014,1015
gender,,,,,,,,,,,,,,,
F,NaN,50000.0,NaN,NaN,70000.0,NaN,20000.0,80000.0,60000.0,30000.0,NaN,40000.0,10000.0,NaN,NaN
M,10000.0,NaN,NaN,60000.0,NaN,50000.0,NaN,NaN,NaN,NaN,90000.0,NaN,NaN,80000.0,50000.0

In [24]:
#duplication  not allowed

df3.pivot(index='gender',columns='city',values='salary')

ValueError: Index contains duplicate entries, cannot reshape

In [ ]:
df3

In [ ]:
df3.pivot(index=['gender','city'],columns=['Id','experience'],values='salary')

In [ ]:
##############################################################################################

### pivot_table

- duplication allowed
- use for reshaping data

### syntax:

dataframe_name.pivot_table(index='column_name',columns='columns_name',values="column_name",fill_value,aggfunc=)

In [25]:
df3

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [26]:
df3.pivot_table(index='gender',columns='city',values='salary')  # duplication allowed

city       beed  bhandara   gondia   mumbai   nagpur     pune
gender
F       45000.0   10000.0  40000.0  50000.0  60000.0  55000.0
M       60000.0   50000.0  80000.0      NaN  70000.0  10000.0

In [28]:
df3

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [31]:
df3.isna().any().sum()

1

In [34]:
#example1

df3.pivot_table(index='gender',columns='city',values='salary',fill_value=0)

city     beed  bhandara  gondia  mumbai  nagpur   pune
gender
F       45000     10000   40000   50000   60000  55000
M       60000     50000   80000       0   70000  10000

In [36]:
df3

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [37]:
# example2

df3.pivot_table(index='gender',columns='city',values='salary',aggfunc='min')  # default=mean

city       beed  bhandara   gondia   mumbai   nagpur     pune
gender
F       20000.0   10000.0  40000.0  50000.0  60000.0  30000.0
M       60000.0   50000.0  80000.0      NaN  50000.0  10000.0

In [38]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Id          15 non-null     int64
 1   gender      15 non-null     object
 2   city        15 non-null     object
 3   experience  15 non-null     int64
 4   salary      14 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 732.0+ bytes

In [ ]:
# example2

df3.pivot_table(index='gender',columns='city',values='salary',margins=True)

In [ ]:
df3.pivot_table(index='gender',columns='city',values='salary',aggfunc='sum',margins=True)

In [ ]:
#################################################################################################################
#################################################################################################################

## datetime module

In [41]:
import datetime

In [42]:
datetime.now()

AttributeError: module 'datetime' has no attribute 'now'

### now()

In [43]:
datetime.datetime.now()

datetime.datetime(2023, 12, 14, 8, 47, 14, 274881)

### today()

In [44]:
datetime.datetime.today()

datetime.datetime(2023, 12, 14, 8, 47, 59, 495600)

#### examples

In [ ]:
datetime.datetime.today()

In [ ]:
datetime.datetime.now()

In [45]:
current_date = datetime.datetime.now()

In [46]:
current_date

datetime.datetime(2023, 12, 14, 8, 49, 50, 523011)

In [47]:
current_date.year

2023

In [48]:
current_date.month

12

In [49]:
current_date.day

14

In [50]:
current_date.hour

8

In [51]:
current_date.minute

49

In [52]:
current_date.second

50

In [53]:
current_date.microsecond

523011

In [54]:
print(current_date.day,'/',current_date.month,'/',current_date.year)

14 / 12 / 2023

In [55]:
print(current_date.day,'-',current_date.month,'-',current_date.year  )

14 - 12 - 2023

### strftime

#### string formatting time

%a Weekday, short version

%A Weekday, full version
%w Weekday as a number 0-6, 0 is Sunday
%d Day of month 01-31
%b Month name, short version
%B Month name, full version
%m Month as a number
%y Year, short version, without century
%Y Year, full version

In [ ]:
# current_date.strftime('%A')

# print(current_date.strftime('%d %B %Y'))

In [56]:
current_date.strftime('%a')

'Thu'

In [57]:
current_date.strftime('%A')

'Thursday'

In [58]:
current_date.strftime('%w')

'4'

In [59]:
current_date.strftime('%d')

'14'

In [60]:
current_date.strftime('%D')

'12/14/23'

#### Months name

In [64]:
current_date.strftime('%b')

'Dec'

In [62]:
current_date.strftime('%B')

'December'

## add column

In [68]:
df3

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [92]:
d = df3['age']=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

In [93]:
df3

      Id gender      city  experience   salary  age
0   1001      M      pune           1  10000.0    1
1   1002      F    mumbai           5  50000.0    2
2   1003      M      pune           4      NaN    3
3   1004      M      beed           6  60000.0    4
4   1005      F      beed           7  70000.0    5
5   1006      M  bhandara           5  50000.0    6
6   1007      F      beed           2  20000.0    7
7   1008      F      pune           8  80000.0    8
8   1009      F    nagpur           6  60000.0    9
9   1010      F      pune           3  30000.0   10
10  1011      M    nagpur           9  90000.0   11
11  1012      F    gondia           4  40000.0   12
12  1013      F  bhandara           1  10000.0   13
13  1014      M    gondia           8  80000.0   14
14  1015      M    nagpur           5  50000.0   15

### add more than one column

In [77]:
d1 ={'xyz':[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15],'abc':[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]}

In [85]:
r=df3.assign(**d1)

In [86]:
r

      Id gender      city  experience   salary  age  xyz  abc
0   1001      M      pune           1  10000.0    1    1    1
1   1002      F    mumbai           5  50000.0    2    2    2
2   1003      M      pune           4      NaN    3    3    3
3   1004      M      beed           6  60000.0    4    4    4
4   1005      F      beed           7  70000.0    5    5    5
5   1006      M  bhandara           5  50000.0    6    6    6
6   1007      F      beed           2  20000.0    7    7    7
7   1008      F      pune           8  80000.0    8    8    8
8   1009      F    nagpur           6  60000.0    9    9    9
9   1010      F      pune           3  30000.0   10   10   10
10  1011      M    nagpur           9  90000.0   11   11   11
11  1012      F    gondia           4  40000.0   12   12   12
12  1013      F  bhandara           1  10000.0   13   13   13
13  1014      M    gondia           8  80000.0   14   14   14
14  1015      M    nagpur           5  50000.0   15   15   15

## drop column

In [87]:
df3

      Id gender      city  experience   salary  age
0   1001      M      pune           1  10000.0    1
1   1002      F    mumbai           5  50000.0    2
2   1003      M      pune           4      NaN    3
3   1004      M      beed           6  60000.0    4
4   1005      F      beed           7  70000.0    5
5   1006      M  bhandara           5  50000.0    6
6   1007      F      beed           2  20000.0    7
7   1008      F      pune           8  80000.0    8
8   1009      F    nagpur           6  60000.0    9
9   1010      F      pune           3  30000.0   10
10  1011      M    nagpur           9  90000.0   11
11  1012      F    gondia           4  40000.0   12
12  1013      F  bhandara           1  10000.0   13
13  1014      M    gondia           8  80000.0   14
14  1015      M    nagpur           5  50000.0   15

In [88]:
df3.drop(['age'],axis=1)

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [95]:
df3.drop([12,11])

      Id gender      city  experience   salary  age
0   1001      M      pune           1  10000.0    1
1   1002      F    mumbai           5  50000.0    2
2   1003      M      pune           4      NaN    3
3   1004      M      beed           6  60000.0    4
4   1005      F      beed           7  70000.0    5
5   1006      M  bhandara           5  50000.0    6
6   1007      F      beed           2  20000.0    7
7   1008      F      pune           8  80000.0    8
8   1009      F    nagpur           6  60000.0    9
9   1010      F      pune           3  30000.0   10
10  1011      M    nagpur           9  90000.0   11
13  1014      M    gondia           8  80000.0   14
14  1015      M    nagpur           5  50000.0   15

#### Month as a number

In [65]:
current_date.strftime('%m')

'12'

#### year

In [ ]:
current_date.strftime('%y')

In [ ]:
current_date.strftime('%Y')

### isoweekday

mon=1
tue=2
sunday=7

In [ ]:
current_date.isoweekday()

### weekday()

In [ ]:
mon=0
sun=6

In [ ]:
current_date.weekday()

### date_range()

In [ ]:
import pandas as pd


f=pd.date_range('2023',periods=12)

f

In [ ]:
pd.date_range(start='1/1/2018', end='1/08/2018')

### more examples

In [ ]:
df3

### Aggregate Function

- sum
- mean
- std
- var
- min
- max

In [ ]:
z2=df3.agg(['max','min','sum','std','var'])
z2

In [ ]:
z1=df2.agg(min)

z1

In [ ]:
df4 =pd.read_csv(r"data.csv")

df4

In [ ]:
df4.agg(['max','min','sum','std','var'])

In [ ]:
df4

### add column

In [ ]:
df4["sub7"]=[12,23,23,45,56,67,78,67,23]

In [ ]:
df4

### records add

In [ ]:
v1 = {"sub1":30,"sub2":45,"sub3":50,"sub4":70}

In [ ]:
df4.loc[1]=v1

In [ ]:
df4

In [ ]:
# df4["sub1"]=[112,113]

# df4

In [ ]:
df4.loc[6,'sub2']=500

In [ ]:
df4